backend/app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
    def index
        brands = Brand.all

INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Taylor"], ["created_at", "2020-06-10 14:44:57.684359"], ["updated_at", "2020-06-10 14:44:57.684359"]]
---
    def create

        new_brand = Brand.new(brand_params)
        if new_brand.save