backend/app/controllers/guitars_controller.rb

SELECT "guitars".* FROM "guitars"
---
  def index
    guitars = Guitar.all

SELECT "guitars".* FROM "guitars" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def show
    options = {}
    options[:include] = [:brand, :'brand.brand_id', :'brand.brand_name']

    guitar = Guitar.find_by(params[:id])

INSERT INTO "guitars" ("name", "category", "year", "created_at", "updated_at", "brand_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bobkat"], ["category", "Electric"], ["year", 1964], ["created_at", "2020-06-12 13:14:28.137422"], ["updated_at", "2020-06-12 13:14:28.137422"], ["brand_id", "3"]]
SELECT "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "guitars" SET "updated_at" = ?, "brand_name" = ? WHERE "guitars"."id" = ?  [["updated_at", "2020-06-12 13:14:28.144070"], ["brand_name", "Silvertone"], ["id", 3]]
---
  def create
    # binding.pry
    # new_guitar = Guitar.new(guitar_params)
    #   if new_guitar.save
    #     render json: GuitarSerializer.new(new_guitar)
    #   else
    #     render json: new_guitar.errors
    #   end
    newGuitar = Guitar.create(brand_id: params['guitar']['brand_id'], name: params['guitar']['name'], category: params['guitar']['category'], year: params['guitar']['year'])
    newGuitar.brand_name = Brand.find_by(id: params['guitar']['brand_id']).name
    newGuitar.save

SELECT "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def destroy
    guitar = Guitar.find_by(id: params[:id])